[
    {
        "position" : "Fullstack Developer",
        "company" : "Aranus Technology",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "June 2024 - Present",
        "tasks" : [
            "Designed and developed a smart farming Android application for laying hen farming, featuring monitoring, analysis, and recording of coop data.",
            "Designed and developed the backend for the application using Laravel, enabling data management, synchronization, and seamless integration with the mobile application",
            "Integrated the backend with the Android application, ensuring efficient data flow between the server and the device, as well as supporting data retrieval and updates.",
            "Conducted testing, code reviews, and debugging of the Android application and its Laravel backend."
        ]
    },

    {
        "position" : "Fresh Graduate Academy (FGA) – Data Science",
        "company" : "Kominfo (Digital Talent Scholarship)",
        "location" : "Remote",
        "tenure" : "Feb 2024 - Mar 2024",
        "tasks" : [
            "Learned to communicate, analyze and visualize data using B.I Tools.",
            "Learned about data types in SQL databases, SQL syntax, and how to create datasets in BigQuery.",
            "Learned the basics of statistics including concepts, data types, methods of drawing conclusions, types of data distribution and correlation.",
            "Learned advanced statistics including sampling methods, hypothesis testing and experimental design A/B testing.",
            "Learned the concept of machine learning, data modeling, functions, benefits and types of data modeling"
        ]
    },

    {
        "position" : "Student Internship",
        "company" : "SMKN 4 Bengkulu",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "Feb 2023 - Jun 2023",
        "tasks" : [
            "Designed Gamacode, an android application that aim to help students understand the concepts of web and mobile programming and track their learning progress with gamification methods.",
            "Developed the application using Kotlin as the programming language, with Koin for dependency injection and Retrofit for managing API communication.",
            "Built the backend using Laravel, responsible for managing user data, learning materials, and student progress.",
            "Deployed the application, making it accessible to students and teachers on Android devices.",
            "Performed usability testing to ensure the application functions properly and meets user needs.",
            "Created comprehensive report on the system design, development and implementation process"
        ]
    },

    {
        "position" : "Software Engineering Laboratory Assistant",
        "company" : "Universitas Bengkulu",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "Aug 2022 - Dec 2022",
        "tasks" : [
            "Assisted with class administration and reporting related to laboratory activities, providing progress reports to the lecturer.",
            "Guided studeGuided students in the use of software modeling tools, including teaching the creation and interpretation of various UML diagrams such as Class, Use Case, Sequence, and Activity Diagrams.nts in the use of software modeling tools, including teaching the creation and interpretation of various UML diagrams such as Class, Use Case, Sequence, and Activity Diagrams.",
            "Monitor the progress of practical projects being undertaken by students and Provide feedback and advice to improve the quality of project outcomes."
        ]
    },

    {
        "position" : "Student Internship",
        "company" : "Faculty of Medicine and Health Sciences Universitas Bengkulu",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "Aug 2022 - Dec 2022",
        "tasks" : [
            "Designed the Objective Structured Clinical Examination (OSCE) assessment information system architecture",
            "Developed the web system using Laravel, implementing key features such as examiner grading interfaces, assessment data processing, and generation of detailed OSCE for faculty.",
            "Created comprehensive report on the system design, development and implementation process"
        ]
    },

    {
        "position" : "Computer and Programming Laboratory Assistant",
        "company" : "Universitas Bengkulu",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "Mar 2022 - Aug 2022",
        "tasks" : [
            "Assisted with class administration and reporting related to laboratory activities, providing progress reports to the lecturer.",
            "Provided guidance to students in the use of Integrated Development Environments (IDEs).",
            "Assessed and offered constructive feedback on students' code.",
        ]
    },

    {
        "position" : "Student Internship",
        "company" : "Department of Communication, Informatics and Statistics",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "",
        "tasks" : [
            "Assisted technicians with the installation of devices at various government agencies in Bengkulu, providing technical support and ensuring efficient installation and optimal functionality of the devices at each institution."
        ]
    }
]