[
    {
        "position" : "Fullstack Developer",
        "company" : "Aranus Technology",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "June 2024 - Present",
        "tasks" : [
            "Responsible for designing, developing, and maintaining a android application for laying hen farming",
            "Responsible for designing, developing, and maintaining the application backend services.",
            "Developed various services using Laravel RESTful API. Implemented authentication and authorization using JWT",
            "Integrating public APIs and third-party services to enhance the application's functionality and support the growth of active users.",
            "Responsible for brainstorming, developing, testing, collaborating, code reviewing, and debugging."
        ]
    },

    {
        "position" : "Fresh Graduate Academy (FGA) – Data Science",
        "company" : "Kominfo (Digital Talent Scholarship)",
        "location" : "Remote",
        "tenure" : "Feb 2024 - Mar 2024",
        "tasks" : [
            "Learn to communicate, analyze and visualize data using B.I Tools.",
            "Learn about data types in SQL databases, SQL syntax, and how to create datasets in BigQuery.",
            "Learn the basics of statistics including concepts, data types, methods of drawing conclusions, types of data distribution and correlation.",
            "Learn advanced statistics including sampling methods, hypothesis testing and experimental design A/B testing.",
            "Learn the concept of machine learning, data modeling, functions, benefits and types of data modeling"
        ]
    },

    {
        "position" : "Software Engineering Laboratory Assistant",
        "company" : "Universitas Bengkulu",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "Agu 2022 - Des 2022",
        "tasks" : [
            "Assist in class administration and reporting related to laboratory activities and provide progress reports to the lecturer.",
            "Provide guidance to students on the use of software modelling tools.",
            "Monitor the progress of practical projects being undertaken by students and Provide feedback and advice to improve the quality of project outcomes."
        ]
    },

    {
        "position" : "Computer and Programming Laboratory Assistant",
        "company" : "Universitas Bengkulu",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "Mar 2022 - Agu 2022",
        "tasks" : [
            "Assist in class administration and reporting related to laboratory activities and provide progress reports to the lecturer.",
            "Train students in the use of programming tools, Integrated Development Environments (IDEs), and related development software.",
            "Provide guidance to students in understanding programming concepts. Assist students in completing programming assignments.",
            "Assess and provide feedback on the code generated by students. Provide guidance in debugging or improving code."
        ]
    }
]