[
    {
        "position" : "Fullstack Developer",
        "company" : "Aranus Technology",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "June 2024 - Present",
        "tasks" : [
            "Designing, developing, and maintaining a android application for laying hen farming",
            "Designing, developing, and maintaining the application backend services.",
            "Developed various services using Laravel RESTful API. Implemented authentication and authorization using JWT",
            "Integrating public APIs and third-party services to enhance the application's functionality and support the growth of active users.",
            "Responsible for brainstorming, developing, testing, collaborating, code reviewing, and debugging."
        ]
    },

    {
        "position" : "Fresh Graduate Academy (FGA) – Data Science",
        "company" : "Kominfo (Digital Talent Scholarship)",
        "location" : "Remote",
        "tenure" : "Feb 2024 - Mar 2024",
        "tasks" : [
            "Learn to communicate, analyze and visualize data using B.I Tools.",
            "Learn about data types in SQL databases, SQL syntax, and how to create datasets in BigQuery.",
            "Learn the basics of statistics including concepts, data types, methods of drawing conclusions, types of data distribution and correlation.",
            "Learn advanced statistics including sampling methods, hypothesis testing and experimental design A/B testing.",
            "Learn the concept of machine learning, data modeling, functions, benefits and types of data modeling"
        ]
    },

    {
        "position" : "Student Internship",
        "company" : "SMKN 4 Bengkulu",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "Feb 2023 - Jun 2023",
        "tasks" : [
            "Designing Android applications that aim to help students understand the concepts of web and mobile programming.",
            "Develop applications using Kotlin as the programming language, with Koin for dependency injection and Retrofit to manage API communication.",
            "Building the application backend using Laravel, which is responsible for managing user data, learning materials, and student progress",
            "Deploy the application so that it can be accessed on students' and teachers' Android devices, and manage system configurations to ensure the application runs optimally in supporting learning."
        ]
    },

    {
        "position" : "Software Engineering Laboratory Assistant",
        "company" : "Universitas Bengkulu",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "Aug 2022 - Dec 2022",
        "tasks" : [
            "Assist in class administration and reporting related to laboratory activities and provide progress reports to the lecturer.",
            "Provide guidance to students on the use of software modelling tools.",
            "Monitor the progress of practical projects being undertaken by students and Provide feedback and advice to improve the quality of project outcomes."
        ]
    },

    {
        "position" : "Student Internship",
        "company" : "Faculty of Medicine and Health Sciences Universitas Bengkulu",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "Aug 2022 - Dec 2022",
        "tasks" : [
            "designing the Objective Structured Clinical Examination (OSCE) assessment information system architecture. The design process includes user needs analysis, user interface (UI/UX) design, and efficient database settings for storing assessment result data.",
            "developing a system using Laravel as a web technology. This process includes implementing key features such as filling in grades by examiners, processing assessment data, and presenting OSCE result reports for students and faculty, as well as ensuring the system functions optimally according to user needs.",
            "prepare a complete report on the system design, development and implementation process."
        ]
    },

    {
        "position" : "Computer and Programming Laboratory Assistant",
        "company" : "Universitas Bengkulu",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "Mar 2022 - Aug 2022",
        "tasks" : [
            "Assist in class administration and reporting related to laboratory activities and provide progress reports to the lecturer.",
            "Train students in the use of programming tools, Integrated Development Environments (IDEs), and related development software.",
            "Provide guidance to students in understanding programming concepts. Assist students in completing programming assignments.",
            "Assess and provide feedback on the code generated by students. Provide guidance in debugging or improving code."
        ]
    },

    {
        "position" : "Student Internship",
        "company" : "Department of Communication, Informatics and Statistics",
        "location" : "Bengkulu, Indonesia",
        "tenure" : "",
        "tasks" : [
            "Assisting technicians in the installation of devices at various government agencies in Bengkulu by providing technical support and ensuring the efficient installation and optimal functionality of the devices in each institution."
        ]
    }
]